"""
2. Создать переменные john_age и marta_age целочисленного типа.
Присвоить созданным переменным значения по своему усмотрению. Вывести в консоль методом print значения обеих переменных.
"""
john_age = 20
marta_age = 19
print(f"John's age is: {john_age} years old")
print(f"Marta's age is: {marta_age} years old")
