"""
1. Создать переменные john_salary и marta_salary вещественного типа (с плавающей точкой).
Присвоить созданным переменным значения по своему усмотрению. Вывести в консоль методом print значения обеих переменных.
"""
john_salary = 5.2
marta_salary = 4.9
print(f"John's salary is: {john_salary}$ per hour")
print(f"Marta's salary is: {marta_salary}$ per hour")







# Good but too much new lines after code
