"""
3. Создать переменные john_name и marta_name строкового типа.
Присвоить созданным переменным значения по своему усмотрению. Вывести в консоль методом print значения обеих переменных.
"""
john_name = "John"
marta_name = "Marta"
print(f"John's name is: {john_name}")
print(f"Marta's name is: {marta_name}")
